/******************************************************************************
filename:   Bsp_CAN.c
version :   v1.0
author  :   ALEX at 2024年7月27日

purpose :   驱动接口层实现模块
note    :   实现硬件层和业务层的剥离

******************************************************************************/
// Inc file -------------------------------------------------------------------
//#include "Publics.h"
#include "BSP_CAN.h"

// 变量定义 --------------------------------------------------------------------


// 函数声明 --------------------------------------------------------------------
void FDCAN1_Init(void);             //CAN1初始化
void FDCAN2_Init(void);             //CAN2初始化
/*
@breif:


 */

void BSP_CAN_Init(void)
{
    FDCAN1_Init();
    FDCAN2_Init();
}

void FDCAN1_Init(void)
{

}

void FDCAN2_Init(void)
{

}


